mdmfile/src/Catalogs/мдмТочкиДействие/мдмТочкиДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиДействие</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДанных</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередСозданиемЗадач</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриСозданииЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПроверкиВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередВыполнением</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриВыполнении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмАвтоматическойОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеВыполнения</name>
    <type>
      <types>CatalogRef.мдмОтборы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмТочкиДействие/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаФормы(ЭтотОбъект);
	
	НастройкаПодсказок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбработатьАвтоматическиПриИзменении(Элемент)
	
	НастройкаФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкаФормы(Форма)
	
	Форма.Элементы.СтраницаАвтоматическаяОбработка.Видимость = Форма.Объект.ОбработатьАвтоматически;
	
КонецПроцедуры	

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.ПередСозданиемЗадач.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до создания задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект создаваемой задачи.
					|		СтандартнаяОбработка - Булево - признак стандартного 
					|		поведения создания задачи.'")	
		);
		
	Элементы.ПриСозданииЗадачи.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после создания задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект созданной задачи.'")	
		);
		
	Элементы.ОбработкаПроверкиВыполнения.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие проверки возможности выполнения задачи.</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект проверяемой задачи.
					|		Результат - Булево - Ложь - отказ от выполнения, Истина - успех.'")	
		);
		
	Элементы.ПередВыполнением.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает до установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполняемой задачи.'")	
		);
		
	Элементы.ПриВыполнении.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Событие возникает после установки признака Выполнена задачи:</b>
		            |
					|<b>Контекст события</b>:
					|	<b>Контекст</b> - Структура - элементы структуры:
					|		Объект - БизнесПроцессОбъект.мдмПроцессОбработки - объект текущего бизнес-процесса.
					|		Задача - ЗадачаОбъект.мдмЗадачаОбработки - объект выполненной задачи.'")	
		);
		
КонецПроцедуры	

#КонецОбласти
